terraform apply
```
terraform apply
2020/04/26 17:28:58 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_ccn_attachment.attachment2 will be created
  + resource "tencentcloud_ccn_attachment" "attachment2" {
      + attached_time   = (known after apply)
      + ccn_id          = "ccn-ffeoxkgx"
      + ccn_uin         = "100009461222"
      + cidr_block      = (known after apply)
      + id              = (known after apply)
      + instance_id     = "vpc-h70b6b49"
      + instance_region = "ap-guangzhou"
      + instance_type   = "VPC"
      + state           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


Warning: Quoted type constraints are deprecated

  on variable.tf line 3, in variable "instance_ip":
   3:   type = "list"

Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "list" and write
list(string) instead to explicitly indicate that the list elements are
strings.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_ccn_attachment.attachment2: Creating...
tencentcloud_ccn_attachment.attachment2: Creation complete after 1s [id=744dd3e6d17be30bbce8470642dc341b]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```